###############################################################################
# Created by write_sdc
###############################################################################
current_design tf_lms_sv
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 20.0000 [get_ports {clock}]
set_clock_transition 0.1000 [get_clocks {clk}]
set_clock_uncertainty 0.2000 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adapt_en}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dxin[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dxin[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dxin[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dxin[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dxin[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dxin[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dxin[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dxin[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {xin[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {xin[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {xin[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {xin[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {xin[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {xin[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {xin[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {xin[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {err[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {err[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {err[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {err[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {err[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {err[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {err[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {err[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {yout[7]}]
set_false_path\
    -from [get_ports {reset}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0500 [get_ports {err[7]}]
set_load -pin_load 0.0500 [get_ports {err[6]}]
set_load -pin_load 0.0500 [get_ports {err[5]}]
set_load -pin_load 0.0500 [get_ports {err[4]}]
set_load -pin_load 0.0500 [get_ports {err[3]}]
set_load -pin_load 0.0500 [get_ports {err[2]}]
set_load -pin_load 0.0500 [get_ports {err[1]}]
set_load -pin_load 0.0500 [get_ports {err[0]}]
set_load -pin_load 0.0500 [get_ports {yout[7]}]
set_load -pin_load 0.0500 [get_ports {yout[6]}]
set_load -pin_load 0.0500 [get_ports {yout[5]}]
set_load -pin_load 0.0500 [get_ports {yout[4]}]
set_load -pin_load 0.0500 [get_ports {yout[3]}]
set_load -pin_load 0.0500 [get_ports {yout[2]}]
set_load -pin_load 0.0500 [get_ports {yout[1]}]
set_load -pin_load 0.0500 [get_ports {yout[0]}]
set_input_transition 0.1000 [get_ports {adapt_en}]
set_input_transition 0.1000 [get_ports {reset}]
set_input_transition 0.1000 [get_ports {dxin[7]}]
set_input_transition 0.1000 [get_ports {dxin[6]}]
set_input_transition 0.1000 [get_ports {dxin[5]}]
set_input_transition 0.1000 [get_ports {dxin[4]}]
set_input_transition 0.1000 [get_ports {dxin[3]}]
set_input_transition 0.1000 [get_ports {dxin[2]}]
set_input_transition 0.1000 [get_ports {dxin[1]}]
set_input_transition 0.1000 [get_ports {dxin[0]}]
set_input_transition 0.1000 [get_ports {xin[7]}]
set_input_transition 0.1000 [get_ports {xin[6]}]
set_input_transition 0.1000 [get_ports {xin[5]}]
set_input_transition 0.1000 [get_ports {xin[4]}]
set_input_transition 0.1000 [get_ports {xin[3]}]
set_input_transition 0.1000 [get_ports {xin[2]}]
set_input_transition 0.1000 [get_ports {xin[1]}]
set_input_transition 0.1000 [get_ports {xin[0]}]
###############################################################################
# Design Rules
###############################################################################
