###################################################################

# Created by write_sdc on Wed Mar 25 23:20:00 2026

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_load -pin_load 0.05 [get_ports {err[7]}]
set_load -pin_load 0.05 [get_ports {err[6]}]
set_load -pin_load 0.05 [get_ports {err[5]}]
set_load -pin_load 0.05 [get_ports {err[4]}]
set_load -pin_load 0.05 [get_ports {err[3]}]
set_load -pin_load 0.05 [get_ports {err[2]}]
set_load -pin_load 0.05 [get_ports {err[1]}]
set_load -pin_load 0.05 [get_ports {err[0]}]
set_load -pin_load 0.05 [get_ports {yout[7]}]
set_load -pin_load 0.05 [get_ports {yout[6]}]
set_load -pin_load 0.05 [get_ports {yout[5]}]
set_load -pin_load 0.05 [get_ports {yout[4]}]
set_load -pin_load 0.05 [get_ports {yout[3]}]
set_load -pin_load 0.05 [get_ports {yout[2]}]
set_load -pin_load 0.05 [get_ports {yout[1]}]
set_load -pin_load 0.05 [get_ports {yout[0]}]
create_clock [get_ports clock]  -name clk  -period 20  -waveform {0 10}
set_clock_uncertainty 0.2  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  2  [get_ports {xin[7]}]
set_input_delay -clock clk  2  [get_ports {xin[6]}]
set_input_delay -clock clk  2  [get_ports {xin[5]}]
set_input_delay -clock clk  2  [get_ports {xin[4]}]
set_input_delay -clock clk  2  [get_ports {xin[3]}]
set_input_delay -clock clk  2  [get_ports {xin[2]}]
set_input_delay -clock clk  2  [get_ports {xin[1]}]
set_input_delay -clock clk  2  [get_ports {xin[0]}]
set_input_delay -clock clk  2  [get_ports {dxin[7]}]
set_input_delay -clock clk  2  [get_ports {dxin[6]}]
set_input_delay -clock clk  2  [get_ports {dxin[5]}]
set_input_delay -clock clk  2  [get_ports {dxin[4]}]
set_input_delay -clock clk  2  [get_ports {dxin[3]}]
set_input_delay -clock clk  2  [get_ports {dxin[2]}]
set_input_delay -clock clk  2  [get_ports {dxin[1]}]
set_input_delay -clock clk  2  [get_ports {dxin[0]}]
set_input_delay -clock clk  2  [get_ports adapt_en]
set_output_delay -clock clk  2  [get_ports {err[7]}]
set_output_delay -clock clk  2  [get_ports {err[6]}]
set_output_delay -clock clk  2  [get_ports {err[5]}]
set_output_delay -clock clk  2  [get_ports {err[4]}]
set_output_delay -clock clk  2  [get_ports {err[3]}]
set_output_delay -clock clk  2  [get_ports {err[2]}]
set_output_delay -clock clk  2  [get_ports {err[1]}]
set_output_delay -clock clk  2  [get_ports {err[0]}]
set_output_delay -clock clk  2  [get_ports {yout[7]}]
set_output_delay -clock clk  2  [get_ports {yout[6]}]
set_output_delay -clock clk  2  [get_ports {yout[5]}]
set_output_delay -clock clk  2  [get_ports {yout[4]}]
set_output_delay -clock clk  2  [get_ports {yout[3]}]
set_output_delay -clock clk  2  [get_ports {yout[2]}]
set_output_delay -clock clk  2  [get_ports {yout[1]}]
set_output_delay -clock clk  2  [get_ports {yout[0]}]
set_input_transition -max 0.1  [get_ports {xin[7]}]
set_input_transition -min 0.1  [get_ports {xin[7]}]
set_input_transition -max 0.1  [get_ports {xin[6]}]
set_input_transition -min 0.1  [get_ports {xin[6]}]
set_input_transition -max 0.1  [get_ports {xin[5]}]
set_input_transition -min 0.1  [get_ports {xin[5]}]
set_input_transition -max 0.1  [get_ports {xin[4]}]
set_input_transition -min 0.1  [get_ports {xin[4]}]
set_input_transition -max 0.1  [get_ports {xin[3]}]
set_input_transition -min 0.1  [get_ports {xin[3]}]
set_input_transition -max 0.1  [get_ports {xin[2]}]
set_input_transition -min 0.1  [get_ports {xin[2]}]
set_input_transition -max 0.1  [get_ports {xin[1]}]
set_input_transition -min 0.1  [get_ports {xin[1]}]
set_input_transition -max 0.1  [get_ports {xin[0]}]
set_input_transition -min 0.1  [get_ports {xin[0]}]
set_input_transition -max 0.1  [get_ports {dxin[7]}]
set_input_transition -min 0.1  [get_ports {dxin[7]}]
set_input_transition -max 0.1  [get_ports {dxin[6]}]
set_input_transition -min 0.1  [get_ports {dxin[6]}]
set_input_transition -max 0.1  [get_ports {dxin[5]}]
set_input_transition -min 0.1  [get_ports {dxin[5]}]
set_input_transition -max 0.1  [get_ports {dxin[4]}]
set_input_transition -min 0.1  [get_ports {dxin[4]}]
set_input_transition -max 0.1  [get_ports {dxin[3]}]
set_input_transition -min 0.1  [get_ports {dxin[3]}]
set_input_transition -max 0.1  [get_ports {dxin[2]}]
set_input_transition -min 0.1  [get_ports {dxin[2]}]
set_input_transition -max 0.1  [get_ports {dxin[1]}]
set_input_transition -min 0.1  [get_ports {dxin[1]}]
set_input_transition -max 0.1  [get_ports {dxin[0]}]
set_input_transition -min 0.1  [get_ports {dxin[0]}]
set_input_transition -max 0.1  [get_ports adapt_en]
set_input_transition -min 0.1  [get_ports adapt_en]
