OpenROAD 26Q1-342-g7c57b1b222 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /home/chuongvo/OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
[INFO ODB-0227] LEF file: /home/chuongvo/OpenROAD-flow-scripts/flow/platforms/nangate45/lef/NangateOpenCellLibrary.tech.lef, created 22 layers, 27 vias
[INFO ODB-0227] LEF file: /home/chuongvo/OpenROAD-flow-scripts/flow/platforms/nangate45/lef/NangateOpenCellLibrary.macro.mod.lef, created 135 library cells
link_design tf_lms_sv
source /home/chuongvo/OpenROAD-flow-scripts/flow/platforms/nangate45/setRC.tcl
write_db ./results/nangate45/tf_lms_sv/base/1_synth.odb
write_sdc -no_timestamp ./results/nangate45/tf_lms_sv/base/1_synth.sdc
Elapsed time: 0:00.45[h:]min:sec. CPU time: user 0.33 sys 0.07 (90%). Peak memory: 112952KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
1_synth                            0            110 da86184a7f5b0c3800cd
