OpenROAD 26Q1-342-g7c57b1b222 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /home/chuongvo/OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_db ./results/nangate45/tf_lms_sv/base/2_1_floorplan.odb
source /home/chuongvo/OpenROAD-flow-scripts/flow/platforms/nangate45/setRC.tcl
No macros found: Skipping macro_placement
write_db ./results/nangate45/tf_lms_sv/base/2_2_floorplan_macro.odb
Elapsed time: 0:00.39[h:]min:sec. CPU time: user 0.32 sys 0.04 (91%). Peak memory: 107752KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_2_floorplan_macro                0            105 6b622b35a76c57038732
