OpenROAD 26Q1-342-g7c57b1b222 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /home/chuongvo/OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_db ./results/nangate45/tf_lms_sv/base/2_2_floorplan_macro.odb
source /home/chuongvo/OpenROAD-flow-scripts/flow/platforms/nangate45/setRC.tcl
[INFO TAP-0004] Inserted 282 endcaps.
[INFO TAP-0005] Inserted 71 tapcells.
write_db ./results/nangate45/tf_lms_sv/base/2_3_floorplan_tapcell.odb
Elapsed time: 0:00.39[h:]min:sec. CPU time: user 0.31 sys 0.04 (90%). Peak memory: 105140KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_3_floorplan_tapcell              0            102 879e479c41245d445c06
