OpenROAD 26Q1-342-g7c57b1b222 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /home/chuongvo/OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_db ./results/nangate45/tf_lms_sv/base/2_3_floorplan_tapcell.odb
source /home/chuongvo/OpenROAD-flow-scripts/flow/platforms/nangate45/setRC.tcl
[INFO PDN-0001] Inserting grid: grid
write_db ./results/nangate45/tf_lms_sv/base/2_4_floorplan_pdn.odb
Elapsed time: 0:00.46[h:]min:sec. CPU time: user 0.34 sys 0.07 (90%). Peak memory: 111256KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_4_floorplan_pdn                  0            108 1578af34e0b7e6df1fbc
