OpenROAD 26Q1-342-g7c57b1b222 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 20 thread(s).
read_liberty /home/chuongvo/OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_db ./results/nangate45/tf_lms_sv/base/5_2_route.odb
source /home/chuongvo/OpenROAD-flow-scripts/flow/platforms/nangate45/setRC.tcl
filler_placement "FILLCELL_X1 FILLCELL_X2 FILLCELL_X4 FILLCELL_X8 FILLCELL_X16 FILLCELL_X32"
[INFO DPL-0001] Placed 9322 filler instances.
write_db ./results/nangate45/tf_lms_sv/base/5_3_fillcell.odb
Elapsed time: 0:00.58[h:]min:sec. CPU time: user 0.48 sys 0.05 (92%). Peak memory: 133448KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
5_3_fillcell                       0            130 74bd8f95b4722a2eb71f
